# AddLBOriginalName

## Description
This function is called when hierarchical display is on and a new item is added to the list browser.

```pascal
PROCEDURE AddLBOriginalName(
				dialogID     : LONGINT;
				componentID  : LONGINT;
				originalName : STRING);
```

```python

def vs.AddLBOriginalName(dialogID, componentID, originalName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The id of the dialog.|
|componentID|LONGINT|The id of the list browser.|
|originalName|STRING|The original name of the new item being added to the list browser.|

## Version
Availability: from Vectorworks 2013
## Category
* Dialogs - Modern - Browser